# GridNetLocationMark Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..GridNetLocationMark Property
ParameterTypeId Class See Also
---
"Location Mark": Provides grid system association information
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId GridNetLocationMark { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property GridNetLocationMark As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ GridNetLocationMark {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace